Revit 2024 API
ElectricalSystem.ApparentLoadPhaseB Property
 The ApparentLoadPhaseB value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double ApparentLoadPhaseB { get; }
Visual Basic
Public ReadOnly Property ApparentLoadPhaseB As Double
	Get
Visual C++
public:
property double ApparentLoadPhaseB {
	double get ();
}
Remarks
 This property is used to retrieve the ApparentLoadPhaseB value of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace